---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyName
source: html/b2b166eb-8e21-5a7a-0e43-b0cfabef0868.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyName Property

"Assembly: Name"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetAssemblyName { get; }
```